{
    "left_bit": [
        "まっ", "別に何も求めてないけど", "やっと目を覚ましたかい？",
        "さ始めようか天体観測", "赤い赤い小さな車が君を乗せて"
    ],
    "songs": [{
        "scripts": ["japanese", "romaji", "english"],
        "name": {
            "english": "Telecaster B-boy",
            "romaji": "Terekyasuta bi-boi",
            "japanese": "テレキャスター　ビーボイ"
        },
        "content_warnings": {
            "english": ["suicide", "bullying", "transphobia"],
            "japanese": ["自殺", "いじめ", "トランスフォビア"]
        },
        "preamble": "Pumped up kicks is a hard song to like as a high-schooler. But it's a bop. It's got that whistled bit. The video has so many people vibing. The frisbee air-bounce. There's a <a href=\"https://www.youtube.com/shorts/DrFh1cuXAVw\">meme comparing it to 夜に駆ける (yoru ni kakeru)</a>. However, that's not the Japanese song that pumped up kicks is like. Telecaster b-boy is that song.<br/> I learned the song as a DDR map that has some fun twists and a quirky video. Then I started to listen to it casually. And I thought I knew what it meant: some sort of romance ending or something about some enigmatic television anchor or something.<br/> After a <a href=\"https://lmgtfy.app/?q=%E3%83%86%E3%83%AC%E3%82%B9%E3%82%BF%E3%83%BC%E3%83%93%E3%83%BC%E3%83%9C%E3%83%BC%E3%82%A4%E6%AD%8C%E8%A9%9E\">quick google search</a>, I realized that I was horrendously wrong. So horrendously wrong that I despaired for a day, convincing myself that my interpretation was one of many. But now I'm much more certain that I know what the song is about. But there's a lot of details that are... hard. And there are many versions of the song that you can find, each of which is fun to listen to and some are interesting interpretations of the original.",
        "lyrics": {
            "japanese": [
               "まっ",
                "大人になるほどDeDeDe<br/>はみ出しものです伽藍堂<br/>人生論者が語った<br/>少女は鳥になって<br/>綺麗事だけでPaPaPa<br/>ボロボロの靴を結んで<br/> デジタル信者が祟った<br/> 少年は風になって<br/>",
                "ゆらりくらり大往生<br/>お疲れ様ですご臨終<br/>",
                "テレキャスタービーボーイ<br/>僕に愛情を<br/>嘘で固めたウォーアイニー<br/>うざったいんだジーガール<br/>魅惑ハイテンション<br/>カニバリズム踊れば<br/>一つ二つ殺めた手で<br/>何を描いているんだろう<br/>テレキャスタービーボーイ<br/>僕に愛情を<br/>誰か答えてくれないか<br/>",
                "見た目がどうやらDeDeDe<br/>ステレオバイアス、サディスティック<br/>毒針持ったように歌った<br/>少女は花になって<br/>耳を塞いでもPaPaPa<br/>奴らの声は派手になって<br/>胸に刺さったあの言葉<br/>少年は振り返って<br/>",
                "ゆらりくらり大妄想<br/>お互い様ですご臨終<br/>",
                "テレキャスタービーボーイ<br/>僕に感情を<br/>ノイズ混じりのウォーアイニー<br/>じれったいんだジーガール<br/>油断禁物さ<br/>頬に溶けた涙を<br/>忘れたくて喉を締めた<br/>過去に残した傷痕<br/>テレキャスタービーボーイ<br/>僕に感情を<br/>今だけ抱いてくれないか<br/>",
                "こんな世界じゃもう<br/>息ができなくて<br/>さよなら告げた現実に<br/>許してはくれないか<br/>弱い僕たちを<br/>また何処かで会いましょう<br/>",
                "テレキャスタービーボーイ<br/>僕に愛情を<br/>嘘で固めたウォーアイニー<br/>うざったいんだジーガール<br/>魅惑ハイテンション<br/>カニバリズム踊れば<br/>一つ二つ殺めた手で<br/>何を描いているんだろう<br/>テレキャスタービーボーイ<br/>僕に愛情を<br/>誰か答えてくれないか<br/>",
                "パルラルラ"
            ],
            "romaji": [
                "ma",
                "otona ni naru hodo dedede<br/>hamidashi mono desu garantou<br/>jinseironshya ga katatta<br/>shyoujyouha tori ni natte<br/>kireigoto dakede papapa<br/>borobrono kutsu wo musunde<br/>dejitarushinjya ga tatatta<br/>shyounen ha kaze ni natte<br/>",
                "yurari kurari daioujyou<br/> otsukaresama desu gorinjyuu",
                "terecasuta biboi<br/>boku ni aijyou wo<br/>uso de katameta wo ai ni<br/>uzattainta jigaru<br/>miwaku hitensyoun<br/>kanibarizumu otoreba<br/>hitotsu futatsu ayameta tede<br/>nani wo egaiteirun tarou<br/>terecasuta biboi<br/>boku ni aijyou wo<br/>dareka kotaete kurenaika<br/>",
                "mitamega dou yara dedede<br/>sutereo baiasu, sadeisutikku<br/>dokubari motta youni utatta<br/>syoujyouwa hana ninatte<br/>mimiwo fusaidemo papapa<br/>yatsura no koe ha hade ni natte<br/>muneni sasatta ano kotoba<br/>syounen ha furi kaette<br/>",
                "yurari kurari daimousou<br/>otagaisamadesu gorinjyuu<br/>",
                "terecasuta biboi<br/>boku ni aijyou wo<br/>noizu majiri no wo ai ni<br/>jirettainta jigaru<br/>yudankinmotsusa<br/>hooni yoketa namida wo<br/>wasuretakute nodowo shimeta<br/>kakoni nokoshita kizuato<br/>terecasuta biboi<br/>boku ni aijyou wo<br/>dareka daite kurenaika<br/>",
                "konna sekai jyamou<br/>ikiga dekinakute<br/>sayonara tsugeta genjitsu ni<br/>yurushite kurenaika<br/>yowai bokutachiwo<br/>mata doko de aimasyou<br/>",
                "terecasuta biboi<br/>boku ni aijyou wo<br/>uso de katameta wo ai ni<br/>uzattainta jigaru<br/>miwaku hitensyoun<br/>kanibarizumu otoreba<br/>hitotsu futatsu ayameta tede<br/>nani wo egaiteirun tarou<br/>terecasuta biboi<br/>boku ni aijyou wo<br/>dareka kotaete kurenaika<br/>",
                "parurarura"
            ],
            "english": [
                "ma",
                "As one becomes an adult dedede<br/>They're also isolated in wide open space.<br/>A life philosopher then spoke up,<br/>The girl became a bird.<br/>Paying only lip service Papapa<br/>Tying on battered shoes.<br/>The digital believer said a curse,<br/>The boy became wind.",
                "Swinging and swaying, Nirvana<br/>Rest well inside hospice care.",
                "Telecaster b-boy<br/>The affection to me<br/>The lie-hardened <i>Je te aime</i><br/>The annoying g-girl<br/>Charmingly excited<br/>Canibalistically dancing<br/>A victim, another, killed of by that hand there,<br/>What could it be drawing?<br/>Telecaster b-boy<br/>The affection to me<br/>Can nobody return?",
                "Wondering on appearance Dedede<br/>Biased and prejudiced<br/>Sadistic<br/>Speaking with those poised barbs<br/>The girl became a flower<br/>Even covering eyes Papapa<br/>The people's voices became harsher<br/>Those words that stabbed the heart<br/>The boy turned around.",
                "Swinging and swaying, Delusions<br/>It's the two of us in hospice care.",
                "Telecaster b-boy<br/>The affection to me<br/>The noise frazzled <i>Je te aime</i><br/>The agitated g-girl<br/>Can't catch a break<br/>The tear melting on the cheek<br/>Wanting to forget, closing down the throat.<br/>The remaining scabs<br/>Telecaster b-boy<br/>The affection to me<br/>Can you just hold me right now?",
                "In this current world<br/>It's impossible to breathe<br/>When a farewell was announced<br/>Could you forgive us?<br/>The weak people.<br/>Let's meet again.",
                "Telecaster b-boy<br/>The affection to me<br/>The lie-hardened <i>Je te aime</i><br/>The annoying g-girl<br/>Charmingly excited<br/>Canibalistically dancing<br/>A victim, another, killed of by that hand there,<br/>What could it be drawing?<br/>Telecaster b-boy<br/>The affection to me<br/>Can nobody return?",
                "Parurarura"
            ]
        },
        "links": [
            "<a href=\"https://youtu.be/i-DZukWFR64\">The original</a>",
            "<a href=\"https://youtu.be/0BIm5TNTe9U\">An english cover (has a lot of translation differences to fit the tune).</a>",
            "<a href=\"https://youtu.be/h_Vl_MmX09E\" alt=\"Yes, I can do the 12, no just a 60%.\">The DDR map that introduced me to this.</a>",
            "<a href=\"https://youtu.be/CbrBh-m9F54\">The internet meme this song seems to be.</a>"
        ]
    },
    {
        "scripts": ["japanese", "romaji", "english"],
        "name": {
            "english": "Rock n' roll, the morning light falls on you",
            "romaji": "Korogaru iwa, kimi ni asa ga furu",
            "japanese": "転がる岩、君に朝が降る"
        },
        "preamble": "The ending of Bocchi the rock hits hard. I mean, here's <a href=\"https://youtu.be/GqV4szgejoI\">a spoiler-laced reaction video that resonates with me</a>. But one thing that stuck with me is the song. After learning about the connection to Asian Kung-fu Generation, I became a fan -- the world world world album is great, <span title=\"kimi no machi made, to your town\">君の街まで</span> slaps, and Re:re: has been stuck in my head since erased anyway.",
        "lyrics": {
            "japanese": [
                "出来れば世界を僕は塗り変えたい<br/>戦争をなくすような大逸れたことじゃない<br/>だけどちょっと それもあるよな",
                "俳優や映画スターには成れない<br/>それどころか 君の前でさえも上手に笑えない<br/>そんな僕に術はないよな",
                "何を間違った それさえもわからないんだ<br/>ローリング ローリング<br/>初めから持ってないのに胸が痛んだ<br/>僕らはきっとこの先も<br/>心絡まって ローリング ローリング<br/>凍てつく地面を転がるように走り出した",
                "理由もないのに何だか悲しい<br/>泣けやしないから 余計に救いがない<br/>そんな夜を温めるように歌うんだ",
                "岩は転がって 僕たちを何処かに連れて行くように ように<br/>固い地面を分けて命が芽生えた<br/>あの丘を越えたその先は<br/>光輝いたように ように<br/>君の孤独も全て暴き出す朝だ",
                "赤い 赤い小さな車は君を乗せて<br/>遠く向こうの角を曲がって<br/>此処からは見えなくなった",
                "何をなくした それさえもわからないんだ<br/>ローリング ローリング<br/>初めから持ってないのに胸が痛んだ<br/>僕らはきっとこの先も<br/>心絡まって ローリング ローリング<br/>凍てつく世界を転がるように走り出した"
            ],
            "romaji": [
                "dekireba sekai wo boku wa nurikaetai<br/>sensou wo nakusu youna taisoureta koto jyanai<br/>dakedo chyotto soremo aruyona",
                "haiyuu ya eiga suta ni ha narenai<br/>soredokoro ka kimi no mae de sae mo jyouzu ni waraenai<br/>sonna boku ni subewa naiyo na",
                "naniwo macchiggata sore sae mo wakaranainda<br/>roringu roringu<br/>hajime kara motte nai noni mune ga itanda<br/>bokura wa kitto kono saki mo<br/>kokorokaramatte roringu roring<br/>itetsuku jimen wo korokaru you ni hashiridashita",
                "wake mo nai no ni nandaka kanashii<br/>nakeya shinai kara yokei ni tsukui ganai<br/>sonna yoru wo atatameru youni utaunda",
                "iwa wo korogatte boku tachi wo dokoka ni tsureteiku youni youni<br/>katai jimen wo wakete inochiga mebaeta<br/>ano oka wo koeta sono sakiha<br/>hikari kagayaita youni youni<br/>kimi no kodoku mo subete bakakidasu asa da",
                "akai akai chiisana kuruma wa kimi wo nosete<br/>tooku mukou no kado wo magatte<br/>koko kara wa mienakunatta",
                "naniwo nakushita sore sae mo wakaranainda<br/>roringu roringu<br/>hajime kara motte nai noni mune ga itanda<br/>bokura wa kitto kono saki mo<br/>kokorokaramatte roringu roring<br/>itetsuku sekai wo korokaru you ni hashiridashita"
            ],
            "english": [
                "If I could I'd repaint the world<br/>Not something as big as world peace<br/>But maybe there's a bit of that too",
                "I can't be an actor or a movie star<br/>Somebody like me? I can't smile properly in front of you<br/>What can a guy like me do?",
                "I don't even know the mistake that I made<br/>rolling rolling<br/>something I didn't have from the start still hurts my heart<br/>surely from now on we'll still<br/>be entangled rolling rolling<br/>running like we're slipping on an icy floor",
                "I don't have a reason, I'm just somewhat sad<br/>I won't cry so I'm more helpless<br/>I'm singing to warm up those nights.",
                "The boulder rolls as if it's taking us some place some place<br/>cutting the hard ground it sprouts life<br/>crossing that hill and beyond that<br/>in the light shining shining<br/>the morning will expose your lonliness",
                "A small small red car, with you in it<br/>turns a distant corner<br/>becomes invisible from here",
                "I don't even know what I have lost<br/>rolling rolling<br/>something I didn't have from the start still hurts my heart<br/>surely from now on we'll still<br/>be entangled rolling rolling<br/>running like we're slipping on an icy world"
            ]
        },
        "links": [
            "<a href=\"https://music.youtube.com/watch?v=ci97r8R1uu8&feature=share\">The original</a>",
            "<a href=\"https://music.youtube.com/watch?v=H7ZyZdqLb5Q&feature=share\">The bocchi the rock version</a>",
            "<a href=\"https://youtu.be/C8Hay53J_Yc\" alt=\"第12話のバージョンじゃないのはおかしい\">A bocchi the rock AMV</a>",
            "<a href=\"https://www.jpopasia.com/asiankungfugeneration/lyrics/18151/world-world-world/korogaru-iwa-kimi-ni-asa-ga-furu-%E8%BB%A2%E3%81%8C%E3%82%8B%E5%B2%A9%E3%80%81%E5%90%9B%E3%81%AB%E6%9C%9D%E3%81%8C%E9%99%8D%E3%82%8B/?cookie=close\">A translation that helped me a lot.</a>"
        ]
    },
    {
        "scripts": ["japanese", "romaji", "english"],
        "name": {
            "english": "Zenzenzense",
            "romaji": "Zenzenzense",
            "japanese": "前前前世"
        },
        "preamble": "I wasn't the biggest fan of this song until I understood the lyrics. But <a href=\"https://youtu.be/ZrXwZpXOiVA\">the movie it's from</a> is great. And the scene it is from is one of the best. (Which I can't find on YouTube T_T so here's <a href=\"https://youtu.be/ZrXwZpXOiVA\">a PV.</a>) Reincarnation love songs FTW. Also the lyrics here are for the original, not the movie version.",
        "lyrics": {
            "japanese": [
                "やっと眼を覚ましたかい<br/>それなのになぜ眼も合わせやしないんだい？<br/>「遅いよ」と怒る君<br/>これでもやれるだけ飛ばしてきたんだよ<br/>心が身体を追い越してきたんだよ",
                "君の髪や瞳だけで胸が痛いよ<br/>同じ時を吸いこんで離したくないよ<br/>遥か昔から知る その声に<br/>生まれてはじめて 何を言えばいい？",
                "君の前前前世から僕は 君を探しはじめたよ<br/>そのぶきっちょな笑い方をめがけて やってきたんだよ<br/>君が全然全部なくなって チリヂリになったって<br/>もう迷わない また１から探しはじめるさ<br/>むしろ０から また宇宙をはじめてみようか",
                "どっから話すかな 君が眠っていた間のストーリー<br/>何億 何光年分の物語を語りにきたんだよ<br/>けどいざその姿この眼に映すと",
                "君も知らぬ君とジャレて 戯れたいよ<br/>君の消えぬ痛みまで愛してみたいよ<br/>銀河何個分かの 果てに出逢えた<br/>その手を壊さず どう握ったならいい？",
                "君の前前前世から僕は 君を探しはじめたよ<br/>その騒がしい声と涙をめがけ やってきたんだよ<br/>そんな革命前夜の僕らを誰が止めるというんだろう<br/>もう迷わない 君のハートに旗を立てるよ<br/>君は僕から諦め方を 奪い取ったの",
                "私たち超えれるかな この先の未来 数えきれぬ困難を<br/>言ったろう 二人なら 笑って返り討ちにきっとできるさ<br/>君以外の武器は 他にはいらないんだ",
                "前前前世から僕は 君を探しはじめたよ<br/>そのぶきっちょな笑い方をめがけて やってきたんだよ<br/>君が全然全部なくなって チリヂリになったって<br/>もう迷わない また１から探しはじめるさ<br/>何光年でも この歌を口ずさみながら"
            ],
            "romaji": [
                "yatto me wo samashita kai<br/>sore nanoni naze memo awaseyashinain dai?<br/>\"osoiyo\" to okoru kimi<br/>kore demo yarerutake tobashitekitandayo<br/>kokoro ga karada wo oi koshite kitandayo",
                "kimi no kami ya hitomi dake de mune ga itaiiyo<br/>onnaji toki wo suikonde hanashitaku naiyo<br/>haraka makashikara shiru sono koe ni<br/>umarete hajimete nani wo iieba ii?",
                "kimino zenzenzense kara bokuwa kimi wo sagashi hajimetayo<br/>sono bukkichyona waraikatawo megakete yattekitandayo<br/>kimiga zenzen zenbu nakunatte chirijiri ni nattatte<br/>mou mayowanai mata ichi kara sagashi hajimerusa<br/>mushiro zero kara mata uchyuu wo hajimetemiyouka",
                "dokkara hanasukana kimi ga nemutteita aida no sutoorii<br/>nanoku nankounen bunno monogatari wo katari ni kitandayo<br/>demo iza sono sugata kono me ni utsusuto",
                "kimi wo shiranu kimi to jyarete tawamuretaiyo<br/>kimi no kienu itami made aishite mitaiyo<br/>ginga nanko bunka no hateni deaeta<br/>sonote wo kowasazu you nigittara ii?",
                "kimino zenzenzense kara bokuwa kimi wo sagashi hajimetayo<br/>sono sawagashi koe to namida wo megake yatte kitandayo<br/>sonna kakumei zenya no bokura wo dare ga tomeru toiun darou<br/>mou mayowanai kimi no haato ni hata wo tateruyo<br/>kimi wa boku kara akirame kata wo ubai tottano",
                "watashitachi koerukana kono saki no mirai oshie kirenu konnan wo<br/>ittarou futarinara waratte kaeriuchi ni kitto dekiruto<br/>kimi igai no bukiwa hokka niwa iranainda",
                "kimino zenzenzense kara bokuwa kimi wo sagashi hajimetayo<br/>sono bukkichyona waraikatawo megakete yattekitandayo<br/>kimiga zenzen zenbu nakunatte chirijiri ni nattatte<br/>mou mayowanai mata ichi kara sagashi hajimerusa<br/>nankounen demo kono uta wo kuchizusaminagara"
            ],
            "english": [
                "At last have you opened your eyes?<br/>Well then why won't you even look me in the eye?<br/>\"You're late,\" you shouted at me,<br/>well I hurried as much as I could,<br/>my heart left my body to come over here.",
                "Your hair or your irises tighten my chest.<br/>Breathing together, I don't want to leave.<br/>This voice I've known forever,</br>meeting you for the first time, what should I even say?",
                "From you last-last-last life I've been looking for you.<br/>That innocent laugh led me here.<br/>Even if every piece of you disappeared, or was scattered everywhere,<br/>I won't waver, I'll start over,<br/>even restart the universe.",
                "Where to start? The story while you were dreaming.<br/>What billion years, what trillion years. That is the story I've come to tell.<br/>But now seeing to reflected in my eyes.",
                "I want to play and know a you you don't know.<br/>I want to love you even the pain you feel.<br/>This hand I've met across galaxies,<br/>how to hold it without breaking it?",
                "From you last-last-last life I've been looking for you.<br/>That loud voice and your tears led me here.<br/>On this eve of our revelution, who can even stop us now?<br/>I won't waver, I'll claim your heart,<br/>because you stole my way to give up.",
                "Will we pass the invisible barriers ahead?<br/>I think us two, will make it through laughing at the end.<br/>I don't need another weapon except for you.",
                "From you last-last-last life I've been looking for you.<br/>That innocent laugh led me here.<br/>Even if every piece of you disappeared, or was scattered everywhere,<br/>I won't waver, I'll start over,<br/>taking million years, singing this song."
            ]
        },
        "links": [
            "<a href=\"https://music.youtube.com/watch?v=Mw66DyjQxBI&feature=share\">The original.</a>",
            "<a href=\"https://music.youtube.com/watch?v=0JD-aUhjgWU&feature=share\" alt=\"なとなく。。。キモいです〜\">English version.</a>",
            "<a href=\"https://pcoroom.com/post-3474/\">A translation I referred to and then avoided.</a>"
        ]
    }]
}
